Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/pic_chip_select.h
// Version 3.00
// Generated 05/12/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC_CHIP_SELECT_H_
#define _PIC_CHIP_SELECT_H_

#define _HEADER_NOT_FOUND

#ifdef _MCP19110
#include <mcp19110.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19111
#include <mcp19111.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19114
#include <mcp19114.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19115
#include <mcp19115.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19116
#include <mcp19116.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19117
#include <mcp19117.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19118
#include <mcp19118.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19119
#include <mcp19119.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19122
#include <mcp19122.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19123
#include <mcp19123.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19124
#include <mcp19124.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19125
#include <mcp19125.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19214
#include <mcp19214.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCP19215
#include <mcp19215.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCV08A
#include <mcv08a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCV14A
#include <mcv14a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCV18A
#include <mcv18a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCV18E
#include <mcv18e.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _MCV28A
#include <mcv28a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10F200
#include <pic10f200.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10F202
#include <pic10f202.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10F204
#include <pic10f204.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10F206
#include <pic10f206.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10F220
#include <pic10f220.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10F222
#include <pic10f222.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10F320
#include <pic10f320.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10F322
#include <pic10f322.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10LF320
#include <pic10lf320.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _10LF322
#include <pic10lf322.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12C508
#include <pic12c508.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12C508A
#include <pic12c508a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12C509
#include <pic12c509.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12C509A
#include <pic12c509a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12C671
#include <pic12c671.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12C672
#include <pic12c672.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12CE518
#include <pic12ce518.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12CE519
#include <pic12ce519.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12CE673
#include <pic12ce673.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12CE674
#include <pic12ce674.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12CR509A
#include <pic12cr509a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F1501
#include <pic12f1501.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F1571
#include <pic12f1571.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F1572
#include <pic12f1572.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F1612
#include <pic12f1612.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F1822
#include <pic12f1822.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F1840
#include <pic12f1840.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F508
#include <pic12f508.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F509
#include <pic12f509.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F510
#include <pic12f510.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F519
#include <pic12f519.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F529T39A
#include <pic12f529t39a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F529T48A
#include <pic12f529t48a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F609
#include <pic12f609.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F615
#include <pic12f615.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F617
#include <pic12f617.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F629
#include <pic12f629.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F635
#include <pic12f635.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F675
#include <pic12f675.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F683
#include <pic12f683.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12F752
#include <pic12f752.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _12HV609
#include <pic12hv609.h>
#undef _HEADER_NOT_FOUND
#endif

