Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/pic_chip_select.h
#ifdef _16LF1788
#include <pic16lf1788.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1789
#include <pic16lf1789.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1823
#include <pic16lf1823.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1824
#include <pic16lf1824.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1824T39A
#include <pic16lf1824t39a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1825
#include <pic16lf1825.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1826
#include <pic16lf1826.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1827
#include <pic16lf1827.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1828
#include <pic16lf1828.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1829
#include <pic16lf1829.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18313
#include <pic16lf18313.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18323
#include <pic16lf18323.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18324
#include <pic16lf18324.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18325
#include <pic16lf18325.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18326
#include <pic16lf18326.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18344
#include <pic16lf18344.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18345
#include <pic16lf18345.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18346
#include <pic16lf18346.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18424
#include <pic16lf18424.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18425
#include <pic16lf18425.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18426
#include <pic16lf18426.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18444
#include <pic16lf18444.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18445
#include <pic16lf18445.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18446
#include <pic16lf18446.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18455
#include <pic16lf18455.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18456
#include <pic16lf18456.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1847
#include <pic16lf1847.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18854
#include <pic16lf18854.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18855
#include <pic16lf18855.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18856
#include <pic16lf18856.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18857
#include <pic16lf18857.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18875
#include <pic16lf18875.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18876
#include <pic16lf18876.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF18877
#include <pic16lf18877.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1902
#include <pic16lf1902.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1903
#include <pic16lf1903.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1904
#include <pic16lf1904.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1906
#include <pic16lf1906.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1907
#include <pic16lf1907.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF19155
#include <pic16lf19155.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF19156
#include <pic16lf19156.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF19175
#include <pic16lf19175.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF19176
#include <pic16lf19176.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF19185
#include <pic16lf19185.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF19186
#include <pic16lf19186.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF19195
#include <pic16lf19195.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF19196
#include <pic16lf19196.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF19197
#include <pic16lf19197.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1933
#include <pic16lf1933.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1934
#include <pic16lf1934.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1936
#include <pic16lf1936.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1937
#include <pic16lf1937.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1938
#include <pic16lf1938.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1939
#include <pic16lf1939.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1946
#include <pic16lf1946.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF1947
#include <pic16lf1947.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF627
#include <pic16lf627.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF627A
#include <pic16lf627a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF628
#include <pic16lf628.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF628A
#include <pic16lf628a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF648A
#include <pic16lf648a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF707
#include <pic16lf707.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF720
#include <pic16lf720.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF721
#include <pic16lf721.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF722
#include <pic16lf722.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF722A
#include <pic16lf722a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF723
#include <pic16lf723.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF723A
#include <pic16lf723a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF724
#include <pic16lf724.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF726
#include <pic16lf726.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF727
#include <pic16lf727.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF73
#include <pic16lf73.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF74
#include <pic16lf74.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF747
#include <pic16lf747.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF76
#include <pic16lf76.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF767
#include <pic16lf767.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF77
#include <pic16lf77.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF777
#include <pic16lf777.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF818
#include <pic16lf818.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF819
#include <pic16lf819.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF83
#include <pic16lf83.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF84
#include <pic16lf84.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF84A
#include <pic16lf84a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF87
#include <pic16lf87.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF870
#include <pic16lf870.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF871
#include <pic16lf871.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF872
#include <pic16lf872.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF873
#include <pic16lf873.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF873A
#include <pic16lf873a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF874
#include <pic16lf874.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF874A
#include <pic16lf874a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF876
#include <pic16lf876.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF876A
#include <pic16lf876a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF877
#include <pic16lf877.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF877A
#include <pic16lf877a.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _16LF88
#include <pic16lf88.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _RF509AF
#include <picrf509af.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _RF509AG
#include <picrf509ag.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _RF675F
#include <picrf675f.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _RF675H
#include <picrf675h.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _RF675K
#include <picrf675k.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _TEST_CHIP_
#undef _HEADER_NOT_FOUND
#endif

#ifdef _HEADER_NOT_FOUND
#error Device-specific header could not be found for target chip
#endif

#endif // _PIC_CHIP_SELECT_H_
